# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод:
# пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод:
# Парам пам-пам


def count_letter(text):
    vowel_list = "аоуыэеёиюя"
    count = 0
    for i in text:
        if i in vowel_list:
            count += 1
    return count


def count_vowel(string):
    result = set(map(lambda x: count_letter(x), string))
    return len(result) <= 1


verse = input("Введите стихотворение: ").lower().split()
if count_vowel(verse):
    print("Парам пам-пам")
else:
    print("Пам парам")
